{

    "ayrintilar": [
        {
            "dersinAdi":"DİFERANSİYEL DENKLEMLER",
            "kod":"MAT 202",
            "yariyil":"4",
            "dersSaati":"4+0",
            "kredi":"4",
            "akts":"6",
            "onerilensecmeli":"None",
            "dersDili":"Türkçe",
            "seviye":"Lisans",
            "tur":"Z",
            "dersinKoordinatoru":"Prof.Dr. Uğur ARİFOĞLU",
            "dersiVeren":"Doç.Dr. Metin YAMAN, Doç.Dr. Ömer Faruk GÖZÜKIZIL  ",
            "yardimcilar":"Arş. Gör. M. Fatih ADAK",
            "dersinAmaci":"Bu dersin amacı, adi diferansiyel denklemlerin (ADD) ve bunların çözüm yöntemlerinin öğretilmesidir. Diferansiyel denklemler, değişen diferansiyel büyüklükler arasındaki ilişkileri ifade ettiğinden, ders kapsamında verilen konular bir tüm mühendislik alanlarına uygulanabilir.",
            "dersinIcerigi":"Temel kavramlar ve diferansiyel denklemlerin sınıflandırılması, Birinci mertebe denklemler ve mühendislik uygulamaları, İkinci ve daha yüksek mertebeli diferansiyel denklemler ve mühendislik uygulamaları, Değişken katsayılı denklemler, Lineer denklem sistemleri: Skaler ve matris yöntemler, Laplace dönüşümü, Mühendislik uygulamaları, Diferansiyel denklemlerin sayısal çözümüne giriş"
        },
        {
            "dersinAdi":"ELEKTRONİK DEVRELER VE LABORATUARI",
            "kod":"BSM 202",
            "yariyil":"4",
            "dersSaati":"3+1",
            "kredi":"4",
            "akts":"7",
            "onerilensecmeli":"None",
            "dersDili":"Türkçe",
            "seviye":"Lisans",
            "tur":"Z",
            "dersinKoordinatoru":"Doç.Dr. Kürşat AYAN",
            "dersiVeren":"Doç.Dr. Kürşat AYAN ",
            "yardimcilar":"Arş. Gör. İsmail Öztel,Arş. Gör. Mustafa Akpınar,Arş.Gör. Soydan Serttaş",
            "dersinAmaci":"Yarı iletken devre elemanlarını tanımak ve bunlara ait devrelerin nerelerde kullanıldığını öğrenmek ve analiz edebilmek, bu devreleri workbench gibi paket programları kullanmak sureti ile simüle etmek ve yine bu devreleri laboratuar ortamında gerçeklemek ve ölçümlemeler yapmayı öğrenmek.",
            "dersinIcerigi":"Yarı iletken malzemeler, ideal diyod, diyod öngerilimleme durumları, diyodun dirençleri, DC girişli seri ve seri-paralel diyod devreleri, VE/VEYA mantık kapıları, doğrultucu, kırpıcı ve kenetleme devreleri, zener diyod uygulamaları, iki kutuplu jonksiyon transistorlerinin(BJT) kutuplanması, BJT nin değişken işaret analizi, FET lerin kutuplanmsı ve işlemsel kuvvetlendiriciler (OPAMP)"
        },
        {
            "dersinAdi":"BİLGİSAYAR ORGANİZASYONU",
            "kod":"BSM 206",
            "yariyil":"4",
            "dersSaati":"3+0",
            "kredi":"3",
            "akts":"6",
            "onerilensecmeli":"None",
            "dersDili":"Türkçe",
            "seviye":"Lisans",
            "tur":"Z",
            "dersinKoordinatoru":"Yrd.Doç.Dr. Ali GÜLBAĞ",
            "dersiVeren":"Yrd.Doç.Dr. Ferhat DİKBIYIK, Yrd.Doç.Dr. Ali GÜLBAĞ",
            "yardimcilar":" ",
            "dersinAmaci":"Derste işlemcinin nasıl çalıştığının ve işlemci birimlerinin tasarım aşamalarının öğrenilmesi amaçlanmıştır.",
            "dersinIcerigi":"Latch ve Flip Floplar, Ardışıl Devrelerin Analizi, Ardışıl Devrelerin Tasarım Adımları, MMLogic Simülatör Programının Tanıtılması, Kaydediciler,Kaydediciler Üzerinde Yapılan İşlemler, Bilgisayar Sistemlerinin Hiyerarşik Yapısı, Yol Kavramı,Bellek,Komutseti Mimarisi, Komut saykılı ve Kontrol Devresinin Zamanlama Düzeneği,Adresleme Yöntemleri,Mikroişlem adımları,Stack Tasarımı,Aritmetik ve Mantık Ünitesinin Tasarımı."
        },
        {
            "dersinAdi":"PROGRAMLAMA DİLLERİNİN PRENSİPLERİ",
            "kod":"BSM 208",
            "yariyil":"4",
            "dersSaati":"3+0",
            "kredi":"3",
            "akts":"6",
            "onerilensecmeli":"None",
            "dersDili":"Türkçe",
            "seviye":"Lisans",
            "tur":"Z",
            "dersinKoordinatoru":"Prof.Dr. Nejat YUMUŞAK",
            "dersiVeren":"Öğr.Gör. Nevzat TAŞBAŞI ",
            "yardimcilar":"Arş.Gör.M. Fatih ADAK",
            "dersinAmaci":"Programlama dillerinin ortak ve temel yönlerinin incelenerek temel programlama temellerinin sunularak kişinin yeni nesil dillere adaptasyonunu kolaylaştırmak. Dilleri sınıflandırabilmek ve problemler için en uygun dilin seçiminde evrensel kritelerin kullanılmasını sağlamak.",
            "dersinIcerigi":"Dillerin tarihçesi ve evrimi, Dil tanımlanması, Dil çevrimi, Temel programlama elemanları, Temel programlama kavramları, Veri tipleri ve veri yapıları, Yapısal programlama kavramları, Altprogramlar, Programlama dillerinde modülasyon, Eş zamanlılık, mantıksal, nesne yönelimli ve fonksiyonel programlama kavramları."
        },
		{
            "dersinAdi":"AYRIK İŞLEMSEL YAPILAR",
            "kod":"BSM 210",
            "yariyil":"4",
            "dersSaati":"3+0",
            "kredi":"3",
            "akts":"5",
            "onerilensecmeli":"None",
            "dersDili":"Türkçe",
            "seviye":"Lisans",
            "tur":"Z",
            "dersinKoordinatoru":"Yrd.Doç.Dr. Nilüfer YURTAY",
            "dersiVeren":"Yrd.Doç.Dr. Nilüfer YURTAY",
            "yardimcilar":"Arş. Gör. Gözde ÖZTEL",
            "dersinAmaci":"1.Matematiksel düşünceyi, sebep-sonuç ilişkisi oluşturmayı öğrenmek.Sayma metotlarına bağlı olarak değişik sayılandırma problemlerinde analiz yapabilmek ve çözüm bulabilmek.Ayrık yapılar (kümeler, permütasyon, bağıntılar, graf, ağaçlar) hakkında bilgi sahibi olmak.Algoritmik düşünme yeteneği kazanabilmek.Ayrık matematik uygulamaları ve modellerinin Bilgisayar Mühendisliği problemlerine nasıl uyarlandığını görmek",
            "dersinIcerigi":"Bilgisayar mühendisliğindeki ve bilgisayar bilimlerindeki matematiksel tekniklere giriş,matematiksel mantık, indüksiyon, küme teorisi, bağıntılar, fonksiyonlar, cebirsel yapılar, graflar, ağaçlar ve eşleme."
        }
    ]
}
